#include<stdio.h>

int main(void){
    //授業の開始時間と終了時間を記録
    int start_end[5][2] = {
        {900, 1030},
        {1040, 1210},
        {1300, 1430},
        {1440, 1610},
        {1620, 1750}
    };
    //時間割を記録
    //time_table[曜日][限][授業名 or 教室]
    char time_table[5][5][2][100] = {
        {{"リテラシ", "1-502"}, {"キャリアデザイン", "11-101"}, {"情報倫理", "G2110"}},
        {{"", ""}, {"英語C", "G3203"}, {"線形代数", "G2209"}, {"英語A", "G3403"}},
        {{"こころの科学", "G2311"}, {"情報数学", "1-501"}},
        {{"プログラミング", "1-502"}, {"プログラミング", "1-502"}, {"データサイエンス", "G2311"}, {"微分積分", "G2209"}},
        {{"", ""}, {"論理回路", "G2210"}, {"フランス語", "G3401"}, {"スポーツ", "鉀徳館"}}
    };

    int day, gen;

    printf("1: 月曜日, 2: 火曜日, 3: 水曜日, 4: 木曜日, 5: 金曜日\n");
    printf("何曜日? ");scanf("%d", &day);
    printf("何限目? ");scanf("%d", &gen);

    //リストは0から始まるので -1する
    day--;
    gen--;

    printf("%s\n", time_table[day][gen][0]);

    return 0;
}